package jan09;

public class Study {

/*
 * 지금까지 공부한것
 * 
 * 초급 : 변수 ~ 배열
 * 		변수, 상수
 * 		데이터타입
 * 		형태변환
 * 		연산자
 * 		표기법
 * 		제어문 for, if
 * 		배열
 * 
 * 
 * 중급 : 클래스 ~ 컬랙션
 * 		클래스 메소드
 * 		정적변수
 * 		new
 * 		null, 기본 값
 * 		생성자, 기본 생성자
 * 		접근제어자 
 * 		인스턴스 변수, 클래스 변수
 * 		상속
 * 		오버라이드, 오버로드
 * 		추상화
 * 		인스턴스
 * 		다형성
 * 		패키지	com.poseidon.test
 * 		어노테이션 @
 * 		jar연동  <-- 이건 오늘
 * 		최상위 타입
 * 		랩퍼클래스
 * 		컬렉션	List, Set, Map, 스텍, 큐
 * 		final	수정불가
 * 		enum
 * 		JVM --- 구조 --- 
 * 
 * 
 * 고급 : 예외처리 ~ 네트워킹(배울것들)
 * 
 * 
 * 
 * 
 * 
 * 
 * 	
 */
}
